Revit 2024 API
CurveArrArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CurveArrArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CurveArrArrayIterator
Visual C++
public:
virtual CurveArrArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace